//
//  Ingredient.swift
//  FoodPin
//
//  Created by Alex on 04.11.2020.
//  Copyright © 2020 Alex. All rights reserved.
//

class RecipeCategories {
    var recipeCategoriesRu = ["Наборы и заготовки", "Блины", "Блюда на пару", "Бургеры и сэндвичи", "Бутерброды", "Вакуум", "Вафли", "Ветчина", "Вторые блюда", "Выпечка", "Гарниры", "Десерты", "Детское меню", "Другие рецепты", "Другие виды чая", "Запеченые блюда", "Здоровое питание", "Зеленый чай", "Каши", "Кисломолочные продукты", "Классический домашний хлеб", "Колбаски", "Консервация", "Копчение", "Кофе", "Люля-кебаб", "Маринады", "Мясо", "Напитки", "Овощи", "Основные блюда", "Паста", "Пироги", "Попкорн", "Птица", "Рыба и морепродукты", "Салаты и закуски", "Сардельки", "Сладкая выпечка", "Смузи", "Сосиски", "Соусы", "Спортивное питание", "Супы", "Тесто", "Фондю", "Фри", "Фрукты и ягоды", "Хлеб", "Хлеб для здорового питания", "Черный чай", "Шашлыки" ]
    var recipeCookingTypeRu = ["Заморозка", "Без термической обработки", "Вакуум", "Варка", "Выпекание", "Вяление", "Жарка", "Заваривание", "Запекание", "На пару", "Сквашивание", "Томление", "Тушение"]
    var recipeCousineStyleRu = ["Азиатская", "Американская", "Английская", "Греческая", "Грузинская", "Еврейская", "Европейская", "Индийская", "Итальянская", "Китайская", "Корейская", "Мексиканская", "Немецкая", "Русская", "Турецкая", "Украинская", "Французская", "Чешская", "Японская"]
    var recipeDietsRu = ["Без глютена", "Без лактозы", "Без сахара", "Вегетарианская", "Детское меню", "Кето-диета", "На пару", "Острая пища", "Постная пища", "Правильное питание", "Стол №1", "Стол №2", "Стол №3", "Стол №4", "Стол №5", "Халяль"]
    var recipeTagsRU = recipeCategoriesRu + recipeCookingTypeRu + recipeCousineStyleRu + recipeDietsRu
    
    
    init (recipeCategoriesRu: [String], recipeCookingTypeRu: [String], recipeCousineStyleRu: [String], recipeDietsRu: [String], recipeTagsRU: [String]) {
        self.recipeCategoriesRu[] = recipeCategoriesRu[]
        self.recipeCookingTypeRu[] = recipeCookingTypeRu[]
        self.recipeCousineStyleRu[] = recipeCousineStyleRu[]
        self.recipeTagsRU[] = recipeTagsRU[]
        
    }
    
    convenience init() {
        self.init(recipeCategoriesRu: ["Наборы и заготовки", "Блины", "Блюда на пару", "Бургеры и сэндвичи", "Бутерброды", "Вакуум", "Вафли", "Ветчина", "Вторые блюда", "Выпечка", "Гарниры", "Десерты", "Детское меню", "Другие рецепты", "Другие виды чая", "Запеченые блюда", "Здоровое питание", "Зеленый чай", "Каши", "Кисломолочные продукты", "Классический домашний хлеб", "Колбаски", "Консервация", "Копчение", "Кофе", "Люля-кебаб", "Маринады", "Мясо", "Напитки", "Овощи", "Основные блюда", "Паста", "Пироги", "Попкорн", "Птица", "Рыба и морепродукты", "Салаты и закуски", "Сардельки", "Сладкая выпечка", "Смузи", "Сосиски", "Соусы", "Спортивное питание", "Супы", "Тесто", "Фондю", "Фри", "Фрукты и ягоды", "Хлеб", "Хлеб для здорового питания", "Черный чай", "Шашлыки" ]
                  , recipeCookingTypeRu: ["Заморозка", "Без термической обработки", "Вакуум", "Варка", "Выпекание", "Вяление", "Жарка", "Заваривание", "Запекание", "На пару", "Сквашивание", "Томление", "Тушение"]
                  , recipeCousineStyleRu: ["Азиатская", "Американская", "Английская", "Греческая", "Грузинская", "Еврейская", "Европейская", "Индийская", "Итальянская", "Китайская", "Корейская", "Мексиканская", "Немецкая", "Русская", "Турецкая", "Украинская", "Французская", "Чешская", "Японская"], recipeDietsRu: ["Без глютена", "Без лактозы", "Без сахара", "Вегетарианская", "Детское меню", "Кето-диета", "На пару", "Острая пища", "Постная пища", "Правильное питание", "Стол №1", "Стол №2", "Стол №3", "Стол №4", "Стол №5", "Халяль"], recipeTagsRU: ["Наборы и заготовки", "Блины", "Блюда на пару", "Бургеры и сэндвичи", "Бутерброды", "Вакуум", "Вафли", "Ветчина", "Вторые блюда", "Выпечка", "Гарниры", "Десерты", "Детское меню", "Другие рецепты", "Другие виды чая", "Запеченые блюда", "Здоровое питание", "Зеленый чай", "Каши", "Кисломолочные продукты", "Классический домашний хлеб", "Колбаски", "Консервация", "Копчение", "Кофе", "Люля-кебаб", "Маринады", "Мясо", "Напитки", "Овощи", "Основные блюда", "Паста", "Пироги", "Попкорн", "Птица", "Рыба и морепродукты", "Салаты и закуски", "Сардельки", "Сладкая выпечка", "Смузи", "Сосиски", "Соусы", "Спортивное питание", "Супы", "Тесто", "Фондю", "Фри", "Фрукты и ягоды", "Хлеб", "Хлеб для здорового питания", "Черный чай", "Шашлыки", "Заморозка", "Без термической обработки", "Вакуум", "Варка", "Выпекание", "Вяление", "Жарка", "Заваривание", "Запекание", "На пару", "Сквашивание", "Томление", "Тушение", "Азиатская", "Американская", "Английская", "Греческая", "Грузинская", "Еврейская", "Европейская", "Индийская", "Итальянская", "Китайская", "Корейская", "Мексиканская", "Немецкая", "Русская", "Турецкая", "Украинская", "Французская", "Чешская", "Японская", "Без глютена", "Без лактозы", "Без сахара", "Вегетарианская", "Детское меню", "Кето-диета", "На пару", "Острая пища", "Постная пища", "Правильное питание", "Стол №1", "Стол №2", "Стол №3", "Стол №4", "Стол №5", "Халяль")
    }
}
